# Income Prediction

In [1]:
import numpy as np
import pandas as pd

## Import Training Data

In [2]:
df_input = pd.read_csv('tcd ml 2019-20 income prediction training (with labels).csv')
df_input.head()

,Instance,Year of Record,Gender,Age,Country,Size of City,Profession,University Degree,Wears Glasses,Hair Color,Body Height [cm],Income in EUR
0,1,1997.0,0,41.0,Belarus,1239930,steel workers,Bachelor,0,Blond,193,61031.94416
1,2,1996.0,other,41.0,Singapore,1603504,safe event coordinator,Master,0,Black,186,91001.32764
2,3,2018.0,other,28.0,Norway,1298017,receivables/payables analyst,PhD,1,Brown,170,157982.17670
3,4,2006.0,other,33.0,Cuba,751903,fleet assistant,No,1,Black,171,45993.75793
4,5,2010.0,female,46.0,United Arab Emirates,95389,lead trainer,0,0,Blond,188,38022.16217

## Import Test Data

In [3]:
df_test = pd.read_csv('Data/tcd ml 2019-20 income prediction test (without labels).csv')
df_test.head()

,Instance,Year of Record,Gender,Age,Country,Size of City,Profession,University Degree,Wears Glasses,Hair Color,Body Height [cm],Income
0,111994,1992.0,other,21.0,Honduras,391652,senior project analyst,Master,1,Brown,153,NaN
1,111995,1986.0,other,34.0,Kyrgyzstan,33653,greeter,Bachelor,0,Black,163,NaN
2,111996,1994.0,unknown,53.0,Portugal,34765,liaison,Bachelor,1,Blond,153,NaN
3,111997,1984.0,0,29.0,Uruguay,1494132,occupational therapist,No,0,Black,154,NaN
4,111998,2007.0,other,17.0,Serbia,120661,portfolio manager,No,0,Red,191,NaN

### Column list Values

In [4]:
np.asarray(list(df_input.columns))

array(['Instance', 'Year of Record', 'Gender', 'Age', 'Country',
       'Size of City', 'Profession', 'University Degree', 'Wears Glasses',
       'Hair Color', 'Body Height [cm]', 'Income in EUR'], dtype='<U17')

### Deleting Hair Color for better performance

In [5]:
del df_input['Hair Color']

In [6]:
del df_test['Hair Color']

### Checking Null Value Count

In [7]:
df_input.isnull().sum()

Instance                0
Year of Record        441
Gender               7432
Age                   494
Country                 0
Size of City            0
Profession            322
University Degree    7370
Wears Glasses           0
Body Height [cm]        0
Income in EUR           0
dtype: int64

In [8]:
df_test.isnull().sum()

Instance                 0
Year of Record         295
Gender                4862
Age                    279
Country                  0
Size of City             0
Profession             195
University Degree     4857
Wears Glasses            0
Body Height [cm]         0
Income               73230
dtype: int64

### Filling Missing Values with mean value

In [9]:
df_input = df_input.fillna(df_input.mean())

In [10]:
df_test = df_test.fillna(df_test.mean())

### Filling Missing string Value with mode value

In [11]:
df_input["Gender"] = df_input["Gender"].fillna(df_input["Gender"].mode()[0])
df_input["Profession"] = df_input["Profession"].fillna(df_input["Profession"].mode()[0])
df_input["University Degree"] = df_input["University Degree"].fillna(df_input["University Degree"].mode()[0])

In [12]:
df_test["Gender"] = df_test["Gender"].fillna(df_test["Gender"].mode()[0])
df_test["Profession"] = df_test["Profession"].fillna(df_test["Profession"].mode()[0])
df_test["University Degree"] = df_test["University Degree"].fillna(df_test["University Degree"].mode()[0])

### Checking if NULL Values are gone or not

In [13]:
df_input.isnull().sum()

Instance             0
Year of Record       0
Gender               0
Age                  0
Country              0
Size of City         0
Profession           0
University Degree    0
Wears Glasses        0
Body Height [cm]     0
Income in EUR        0
dtype: int64

In [14]:
df_test.isnull().sum()

Instance                 0
Year of Record           0
Gender                   0
Age                      0
Country                  0
Size of City             0
Profession               0
University Degree        0
Wears Glasses            0
Body Height [cm]         0
Income               73230
dtype: int64

### Applying filter to reduce Garbage Value

In [15]:
from scipy.signal import lfilter

n = 125  # the larger n is, the smoother curve will be
b = [1.0 / n] * n
a = 1
df_input[["Year of Record", "Age", "Size of City", "Wears Glasses", "Body Height [cm]"]] = lfilter(b,a,df_input[["Year of Record", "Age", "Size of City", "Wears Glasses", "Body Height [cm]"]])

In [16]:
from scipy.signal import lfilter

n = 125  # the larger n is, the smoother curve will be
b = [1.0 / n] * n
a = 1
df_test[["Year of Record", "Age", "Size of City", "Wears Glasses", "Body Height [cm]"]] = lfilter(b,a,df_test[["Year of Record", "Age", "Size of City", "Wears Glasses", "Body Height [cm]"]])

### Cheking Values after filter

In [17]:
df_input.head()

,Instance,Year of Record,Gender,Age,Country,Size of City,Profession,University Degree,Wears Glasses,Body Height [cm],Income in EUR
0,1,15.976,0,16.304,Belarus,9935.744,steel workers,Bachelor,9935.744,9937.288,61031.94416
1,2,15.968,other,16.296,Singapore,12844.328,safe event coordinator,Master,12844.328,12845.816,91001.32764
2,3,16.144,other,16.368,Norway,10400.504,receivables/payables analyst,PhD,10400.512,10401.872,157982.17670
3,4,16.048,other,16.312,Cuba,6031.536,fleet assistant,No,6031.544,6032.912,45993.75793
4,5,16.080,female,16.448,United Arab Emirates,779.560,lead trainer,0,779.560,781.064,38022.16217

In [18]:
df_test.head()

,Instance,Year of Record,Gender,Age,Country,Size of City,Profession,University Degree,Wears Glasses,Body Height [cm],Income
0,111994,15.936,other,16.104,Honduras,3149.320,senior project analyst,Master,3149.328,3150.552,NaN
1,111995,15.888,other,16.160,Kyrgyzstan,285.384,greeter,Bachelor,285.384,286.688,NaN
2,111996,15.952,unknown,16.376,Portugal,294.496,liaison,Bachelor,294.504,295.728,NaN
3,111997,15.872,0,16.104,Uruguay,11969.160,occupational therapist,No,11969.160,11970.392,NaN
4,111998,16.056,other,16.192,Serbia,981.480,portfolio manager,No,981.480,983.008,NaN

### Replace 0 with unknown in Gender Column

In [19]:
df_input.Gender = df_input.Gender.replace('0', 'unknown')
df_test.Gender = df_test.Gender.replace('0', 'unknown')

### Applying OneHot on Columns with String Values

In [20]:
df_input = pd.concat((df_input,pd.get_dummies(df_input.Gender)),1)
del df_input['Gender']
df_input = pd.concat((df_input,pd.get_dummies(df_input.Profession)),1)
del df_input['Profession']
df_input = pd.concat((df_input,pd.get_dummies(df_input['University Degree'])),1)
del df_input['University Degree']
df_input = pd.concat((df_input,pd.get_dummies(df_input['Country'])),1)
del df_input['Country']
df_input.shape

(111993, 1516)

In [21]:
df_test = pd.concat((df_test,pd.get_dummies(df_test.Gender)),1)
del df_test['Gender']
df_test = pd.concat((df_test,pd.get_dummies(df_test.Profession)),1)
del df_test['Profession']
df_test = pd.concat((df_test,pd.get_dummies(df_test['University Degree'])),1)
del df_test['University Degree']
df_test = pd.concat((df_test,pd.get_dummies(df_test['Country'])),1)
del df_test['Country']
df_test.shape

(73230, 1498)

### Arrange Both the tables with same number of column's for applying Linear Regression.

In [22]:
del_val = list(set(list(df_input.columns) ) - set(list(df_test.columns) ) - set(['Income in EUR']))
del_val = np.asarray(del_val)
df_input.drop(del_val, axis=1, inplace=True)
df_input.shape

(111993, 1481)

In [23]:
del_val = list(set(list(df_test.columns) ) - set(list(df_input.columns) ) - set(['Income']))
del_val = np.asarray(del_val)
df_test.drop(del_val, axis=1, inplace=True)
df_test.shape

(73230, 1481)

### Applying Linear Regression
### Taking last 30,000 entries for test data and remaining for training purpose

In [24]:
from sklearn.linear_model import LinearRegression
X = df_input.loc[:, df_input.columns != 'Income in EUR'].values
y = df_input["Income in EUR"].values

test_size = 30000

X_train = X[:-test_size]
y_train = y[:-test_size]

X_test = X[-test_size:]
y_test = y[-test_size:]

clf = LinearRegression().fit(X_train, y_train)
clf.fit(X_train, y_train)

print(clf.score(X_test, y_test))

0.7155966843114785

In [25]:
for X,y in list(zip(X_test, y_test))[:200]:
    print(clf.predict([X])[0], y)

8147.643511604052 29027.49544
199266.32885057805 136765.7695
409953.97731478093 356266.2085
475361.1944713625 400708.9818
58115.31711823819 60775.30183
26525.250171254855 32761.244039999998
13223.31678969739 37810.76192
64013.035078178626 51157.76369
687.7610303121619 6662.099034000001
-24239.97402601363 17450.05561
82862.2023665416 27387.2982
35862.907741616946 64724.876729999996
150487.78605980752 199764.8093
42395.371489706915 7928.719048999999
38886.11228091596 39949.23942
23450.448914249893 716212.0
132346.7341938722 38091.90994
-17470.661530424375 15314.80641
304935.0255366671 248592.5746
95972.2711017835 63535.84277
13750.320563744288 23929.54421
-5419.121902514715 22784.3852
154702.01739985822 87100.09671
39191.85363371251 814061.0
382522.6173969018 304184.5087
26333.060362409335 29845.551710000003
61980.297017059755 35315.76195
-51286.46783177974 25006.634169999998
161953.31096727727 169207.2925
109397.18390471814 49001.84602
62752.11283430038 54110.20522
95055.20492465375 36634.830539999995
101787.9402306783 77649.2549
199225.73350007413 176066.1597
20767.097669194918 44232.480910000006
152649.8408408868 114728.2599
86176.49091191171 41170.12631
61860.24697040161 53387.879839999994
304419.3561963546 298480.2818
361802.43787933467 436554.098
-14111.391073633451 26846.649289999998
52078.02998931287 42257.1474
131194.11834652303 122066.2792
143559.19525940297 168829.7129
-31905.06116502406 5652.53993
91898.74748729123 29999.878539999998
240874.43685765145 160726.6985
101973.7745652902 124197.1217
31908.541150401812 66582.01802
77079.55522740958 51155.54683
27137.910608123522 28881.51165
7290.661327670794 30665.86731
38076.03435392259 50312.55594
107322.52661825297 118491.9178
456798.6005317825 352915.0788
150.9588856282644 19913.898830000002
-748.1357490015216 24206.82341
-19506.04974103393 16666.73699
174313.95014704159 174678.8819
3307.355250846129 29418.079189999997
97303.10407157568 81356.44209
212118.17957251845 140549.9227
111508.82373456238 37215.88683
127772.21790630696 90229.69744
18239.357674788218 21762.0377
18793.017634585034 42161.26763
-53363.239848185796 18374.6426
106215.8708883035 131675.2045
40676.809733222704 61617.762689999996
126908.20204090653 106878.1286
151124.43510229466 136930.6665
113638.66141350148 124892.8367
-34258.663123343606 3735.443686
132345.38461310742 98370.17869
15041.86507897405 16118.586819999999
105502.6463417518 83003.93509
181641.49775905488 198518.0307
203218.72444052575 310512.6526
301907.2280615675 467698.5099
25263.693737100344 31375.9539
60937.67495972989 48759.3889
78197.06100304006 61028.58908
94393.76891168533 22231.637000000002
103211.06005484937 86906.43071
76439.86432559369 68089.3465
472181.19734461186 326437.597
-2983.3125900928862 19430.31155
54020.62809586106 22753.85615
57569.88101823209 38651.71944
200193.24694101093 157681.586
-18856.429732729215 29960.44672
86868.89477462647 70229.23443
17539.5648585069 36747.83793
126994.41169841168 66332.64235
1166.7110832440667 34550.130730000004
43380.65524060605 42991.86597
40517.6498053777 69072.782
74577.98074216722 39579.119230000004
45548.31812388776 39848.44764
256418.45616979478 417135.4582
-52495.49445511075 -32.82780892
21376.628193329554 54347.87463
13267.355580877047 35667.08367
144449.75743187545 173999.2882
89394.88227595342 37722.36488
201280.13508703886 105401.4728
94989.22744042752 114226.8014
142776.2245201352 73248.97493
595241.4617372262 1040885.212
43687.592902730685 44697.1429
153701.12020104704 158423.7909
26695.516857042443 19488.7795
133722.0115209329 94050.41328
29774.134586404543 23228.9272
38878.421369861346 41525.133010000005
42566.20589227555 23838.17628
-50522.087158848066 17426.37716
79676.03803689359 76442.91055
114984.1959950286 92134.15372999999
139543.1134106177 124767.8869
49905.459689091425 37747.18892
-35858.30877797725 13912.700469999998
23216.6519560623 13208.30821
190749.45575101255 109343.1819
216646.22212403594 218682.4999
89166.02924830792 94603.99669
195880.38800675748 224953.7613
37010.86568887113 53738.06565
39516.298548202496 27479.29995
72580.51842505811 63200.1086
10666.008359144907 5964.55664
136535.5080817449 44451.1648
75942.63452489255 76959.65238
287470.14601990907 465360.3608
19415.365994166117 21343.31871
45984.761979195755 15224.689769999999
96322.49170773802 69511.11935
105902.93007422565 63999.467710000004
64053.991335223895 36476.50763
168099.8212429802 110172.4071
56225.3721920955 59134.0983
54362.3901615846 24059.05524
14435.584342311602 21014.24602
11164.489293183666 6111.031981
230252.96635193704 254361.5837
-1425.956310201902 15949.6159
71796.77037054813 64698.39297000001
50828.71413631318 70962.55425
-2375.5282404911704 15828.98968
24408.124510120135 37684.23706
-47654.54252188327 22338.085059999998
109163.82836974738 96926.7619
-4708.085300921928 24028.22052
34442.92897803662 44796.62993
-78396.20613091113 19997.05313
34284.76309839217 27460.38086
68109.7880948293 51529.231380000005
26797.831563423853 28863.896839999998
-39894.90575592639 26226.65931
90336.6873254287 96088.42145
40472.204644310754 25118.939919999997
191103.01023335336 245032.2772
172862.3743543732 161948.1999
61314.046165700536 48349.98109
20064.169614504557 53073.662860000004
679444.0467890012 718773.2843
56676.704278479796 23577.88751
11848.076302598696 37907.81248
-89089.01377956988 20978.99515
133300.82188494084 108856.6538
73514.33562953351 51300.48297
111707.67997319577 62260.26124
132562.40354890702 76200.45397999999
-20353.963501383085 31937.81118
72969.06347734807 49450.53454
47950.46228630422 69119.42004
115201.17401809571 40092.722160000005
60546.3524580705 53561.07099
432958.654836725 299474.2979
219873.06286752922 310508.5805
388484.34445245145 217923.135
447205.83786654053 860472.7856
131978.22121937154 124901.0401
35851.48435001029 47367.92993
139807.1352761495 97338.29342
156665.332122277 79388.35936
56689.99064786313 72378.58477999999
11123.001980246976 12303.61057
55474.92219598172 60681.83821
-51653.00917880656 30096.97505
74530.76583034871 77518.7487
70077.12156803487 100222.1662
104465.57032353757 88947.39715
114058.26391751645 82395.90926
301424.58926113276 243017.3527
120815.94054577826 34912.02345
-13541.610099150334 8051.951218000001
2831.76620478509 29664.03685
329179.40249807714 385157.0482
24949.02682764409 50937.97262

### Writing in file

In [26]:
test_X = df_test.loc[:, df_test.columns != 'Income'].values
prediction_value = clf.predict(test_X)

In [27]:
df_test['Income'] = prediction_value
file = df_test[['Instance', 'Income']]

### File is Exported!.

In [28]:
export_csv = file.to_csv("tcd ml 2019-20 income prediction submission file.csv", index = None, header = True)